Repository: xkain/Scripts-ToggleSwitchs
Catalog: translate/*.po
Languages: fr

source: Scripts ToggleSwitchs
fr: Scripts Interrupteurs

source: Configurable ToggleSwitchs to launch scripts.
fr: Interrupteurs configurables pour lancer des scripts.

source: Compact Switch
fr: Interrupteurs compact

source: Extended Switches
fr: Interrupteurs Étendus

source: Name Switch
fr: Nom de l’interrupteur

source: Name :
fr: Nom :

# @action:button
source: Clear Name
fr: Effacer Nom

source: Options font :
fr: Options police :

source: Will be displayed on desktop
fr: Sera affiché sur le bureau

source: Activated :
fr: Activé :

# @action:button
source: Clear script
fr: Effacer script

source: Choose script for position activated
fr: Choisir le script pour la position activée

source: Disabled :
fr: Désactivé :

source: Run script at startup
fr: Exécuter le script au démarrage

source: Position on startup :
fr: Position au démarrage :

source: Remembers last position
fr: Se rappel de la dernière position

source: Disabled position
fr: Position désactivée

source: Position activated
fr: Position activée

source: ToolTip
fr: Info-bulle

# @title:label
source: Title :
fr: Titre :

source: Will display output script
fr: Affichera la sortie du script

source: Output script will refresh every :
fr: La sortie du script se rafraîchira toutes les :

source: Show notification when the switch becomes activated
fr: Afficher notification lorsque l'interrupteur devient activé

# @title:label
source: Text :
fr: Texte :

# @title:label
source: Icon :
fr: icône :

source: Show notification when switch becomes disabled
fr: Afficher notification lorsque l'interrupteur devient désactivé

source: Default Group Switch
fr: Interrupteur de groupe par défaut

source: This is the description of the Default Group Switch. Switch Groups create a new column and can control the position of all the switches that are in their column.
fr: Ceci est la description de l'interrupteur de groupe par défaut. Les groupes d'interrupteurs créent une nouvelle colonne.

source: Switch activation
fr: Interrupteur activé

source: This notification is displayed because the Default switch Group has been activated.
fr: Cette notification s'affiche car l'interrupteur par défaut de groupe a été activé.

source: Switch deactivation
fr: Désactivation interrupteur

source: This notification is displayed because the Default switch Group has been deactivated.
fr: Cette notification s'affiche car l'interrupteur par défaut de groupe a été désactivé.

source: Edit
fr: Éditer

source: Delete
fr: Effacer

source: Add Switch Group…
fr: Ajouter Groupe…

source: Group
fr: Groupe

source: This is the description of the Group Switch. Switch Groups create a new column and can control the position of all the switches that are in their column.
fr: Ceci est la description de l'interrupteur de groupe. Les interrupteurs de groupes créent une nouvelle colonne et peuvent contrôler la position de tous les interrupteur qui se trouvent dans leur colonne.

source: This notification is displayed because the switch Group has been activated.
fr: Cette notification s'affiche car l'interrupteur de groupe a été activé.

source: This notification is displayed because the switch Group has been deactivated.
fr: Cette notification s'affiche car l'interrupteur de groupe a été désactivé.

source: Add Switch…
fr: Ajouter Interrupteur…

source: Switch
fr: Interrupteur

source: This is the description of a normal Switch. It is always placed below a Switch Group, and its activation can be controlled by a Switch Group.
fr: Ceci est la description d’un Switch normal. Il est toujours placé sous un Switch de Groupe, et son activation peut être contrôlée par un Switch de Groupe.

source: This notification is displayed because the switch has been activated.
fr: Cette notification s'affiche car l'interrupteur a été activé.

source: This notification is displayed because the switch has been deactivated.
fr: Cette notification s'affiche car l'interrupteur a été désactivé.

source: Edit Switch
fr: Éditer Interrupteur

source: Follow Compact :
fr: Suivre le Compact

source: It will follow the position of the Compact Switch
fr: Il suivra la position de l'interrupteur Compact

source: Follow Group :
fr: Suivre le Groupe

source: It will follow the position of the Group switch
fr: Il suivra la position de l'interrupteur Groupe

source: Show ToolTip :
fr: Active l'infobulle

source: Display a tooltip on switch when mouse hover.
fr: Affiche l'info-bulle au passage de la souris

# @item:inmenu Open icon chooser dialog
source: Choose...
fr: Choisir...

# @item:inmenu Reset icon to default
source: Clear Icon
fr: Effacer l’Icône

source: Scripts ToggleSwitchs
fr: Scripts Interrupteurs

source: Configurable switches to launch scripts.
fr: Interrupteurs configurables pour lancer des scripts.

source: The switch has been activated
fr: L'interrupteur a été activé
